// ИНТЕРФЕЙС
//battle_window hints
btn_options_hint=^hint_Btn_t^Menu [hkey](Esc)
btn_sur_hint=^hint_Btn_t^Run away [hkey](S)

btn_auto_hint=^hint_Btn_t^Autocombat On/Off [hkey](A)
btn_book_hint=^hint_Btn_t^Spell Book [hkey](B)

btn_Spec_hint=Special abilities
btn_AP_hint=^int_def_t0_AP^Action Points: ^/^.
btn_wait_hint=^hint_Btn_t^Wait [hkey](W)
btn_def_hint=^hint_Btn_t^Defense [hkey](D)
btn_log_UP=Up
btn_log_Down=Down
btn_tactics=^int_def_t15sc^Begin combat!


btn_battle_mana_hint=^int_def_t0_mm^Mana: ^[hero_mana]^([hero_mana_max])
btn_battle_enemy_mana_hint=^int_def_t0_mm^Mana: ^[enemy_mana]^([enemy_max_mana]
btn_battle_rage_hint=^int_def_t0_mm^Rage: ^[hero_rage]^([hero_rage_max])


log_autofight_on=^blog_td0^[g]Autocombat On
log_autofight_off=^blog_td0^[g]Autocombat Off

attack_hint=^scr_attack_hint^

btn_casket_hint=^hint_Btn_t^Chest of Rage [hkey](R)

rage_bonus=^add_manarage_t^[rage]
mana_bonus=^add_manarage_t^[mana]
enemy_mana_bonus=^add_manarage_t^[enemy_mana]

hero_face_hint_header=^int_dig_t14sc^[hero_name] (level [hero_level]) 
hero_face_hint=^ally_hero_t^Attack: [attack] Defense: [defense] Intellect: [intellect]  

enemy_hero_face_hint_header=^enemy_hero_tHName^[name] (level [level])
enemy_hero_face_hint=^enemy_hero_t^Attack: [attack] Defense: [defense] Intellect: [intellect]  

// СПЕЦ АТАКИ СЕЛЕКТОРЫ
// для заклинаний
bmsg_teleport_1=Select the troop you wish to move.
bmsg_teleport_2=Choose a new position for the selected troop.
bmsg_change_1=Select the troop you wish to swap.
bmsg_change_2=Select the troop which you want to swap with the selected troop.
bmsg_sacrifice_1=Select the troop you wish to sacrifice.
bmsg_sacrifice_2=Select the troop you wish to reinforce.
bmsg_phantom_1=Select the troop to create its phantom.
bmsg_phantom_2=Select a place you wish to create the phantom.
bmsg_dominator_1=Select the troop over which you wish to gain control.
bmsg_dominator_2=Choose an enemy target.
bmsg_telekines_1=Choose a friendly troop you wish to move.
bmsg_telekines_2=Select the place you wish to move the selected troop.

// battle attack header
bah_tactics=Tactics mode. You may arrange your troops!
add_blog_tactics=^blog_td0^[g]You are in Tactics mode.<br>[com]In this mode you can arrange your troops within the available space on the battlefield! After choosing a troop, you can place it on a free cell or swap it with another troop.

// выход из под контроля
out_of_control_log=^blog_td0^[g]Out of control![/c] [ally][special][/c] are no longer under your control!
return_control_log=^blog_td0^[g]Control regained![/c] [ally][special][/c] obey you again!

// БОЕВОЙ ЛОГ
//БАЗОВЫЕ АТАКИ
// Один ударил
admg_10=^blog_td0^[miss][krit][name] does [damage] points of damage. Target: [targets].
// Один ударил, один погиб
admg_11=^blog_td0^[miss][krit][name] does [damage] points of damage. [repl1][dead] [target] is killed.//[troopdef]
// Один ударил, много погибло
admg_12=^blog_td0^[miss][krit][name] does [damage] points of damage. Killed [targets]: [dead]. [troopdef]
// Много ударили
admg_20=^blog_td0^[miss][krit][name] do [damage] points of damage. Target: [targets].
// Много ударили, один погиб
admg_21=^blog_td0^[miss][krit][name] do [damage] points of damage. [repl1][dead] [target] is killed. //[troopdef]
// Много ударили, много погибло
admg_22=^blog_td0^[miss][krit][name] do [damage] points of damage. Killed [targets]: [dead]. [troopdef]

// Массовый урон
admg_1=^blog_td0^[name] inflicts area damage:
// Ударили много, ударили многими, погибло ещё больше
admg_2=^blog_td0^[name] inflict area damage:
admg_3=^blog_td0^[name] inflicts no damage.

//СПЕЦ. АТTАКККИ!!!
// Один ударил
admg_10s=^blog_td0^[miss][krit][name] uses the ability [saname]. Damage: [damage]. Target: [targets].
// Один ударил, один погиб
admg_11s=^blog_td0^[miss][krit][name] uses the ability [saname]. Damage: [damage]. [repl1][dead] [target] is killed. //[troopdef]
// Один ударил, много погибло
admg_12s=^blog_td0^[miss][krit][name] uses the ability [saname]. Damage: [damage]. Killed [targets]: [dead]. [troopdef]
// Много ударили
admg_20s=^blog_td0^[miss][krit][name] use the ability [saname]. Damage: [damage]. Target: [targets].
// Много ударили, один погиб
admg_21s=^blog_td0^[miss][krit][name] use the ability [saname]. Damage: [damage]. [repl1][dead] [target] is killed. //[troopdef]
// Много ударили, много погибло
admg_22s=^blog_td0^[miss][krit][name] use the ability [saname]. Damage: [damage]. Killed [targets]: [dead]. [troopdef]

// Массовый урон
admg_1s=^blog_td0^[name] uses the ability [saname]. Area damage is inflicted:
// Ударили много, ударили многими, погибло ещё больше
admg_2s=^blog_td0^[name] use the ability [saname]. Area damage is inflicted:


use_sattack_11=^blog_td0^[name] uses the ability [saname].
use_sattack_12=^blog_td0^[name] use the ability [saname].
use_sattack_21=^blog_td0^[name] uses the ability [saname]. Target: [targeta].
use_sattack_22=^blog_td0^[name] use the ability [saname]. Target: [targeta].
openbox_1=^blog_td0^[name] opens the chest.
openbox_2=^blog_td0^[name] open the chest.

//Лучник получает 50 урона.
arcv_10=^blog_td0^[tab][miss][krit][repl3][name] suffers [damage] points of damage[/repl].
arcv_11=^blog_td0^[tab][miss][krit][name] suffers [damage] points of damage and [repl2]dies[/repl]. //[troopdef]

//Лучники получают 50 урона. 10 убито.
arcv_20=^blog_td0^[tab][miss][krit][name] suffer [damage] points of damage.
arcv_21=^blog_td0^[tab][miss][krit][name] suffered [damage] points of damage. [dead] are killed. [troopdef]
arcv_22=^blog_td0^[tab][miss][krit][name] get [damage] points of damage. [dead] are killed. [troopdef]


hero_casts_a_spell_1=^blog_td0^[hero_name] casts the spell [spell].
hero_casts_a_spell_2=^blog_td0^[hero_name] casts the spell [spell]. Target: [targeta].

add_blog_sadrenlin=^blog_td0^[hero_name] casts the spell [spell], granting the target an additional turn. Target: [targeta].
add_blog_sinvis_1=^blog_td0^[hero_name] casts the spell [spell]. [targeta] becomes invisible!
add_blog_sinvis_2=^blog_td0^[hero_name] casts the spell [spell]. [targeta] become invisible!
add_blog_sram=^blog_td0^[hero_name] turns the enemy troop into sheep. Target: [targeta].
add_blog_sram1=^blog_td0^[hero_name] turns the enemy troop into sheep. Target: [targeta].
add_blog_sram2=^blog_td0^[hero_name] turns the enemy troop into sheep. Target: [targeta].
//add_blog_sram1=^blog_td0^[hero_name] превращает отряд противника в баранов! Цель: [targeta].
add_blog_shypnos=^blog_td0^[hero_name] casts [spell] and charms the enemy troop. Target: [targeta].
add_blog_shypnos1=^blog_td0^[hero_name] casts [spell] and charms the enemy target. Target: [targeta].
add_blog_ssacr_1=^blog_td0^[hero_name] casts the spell [spell]. Target ([targeta]) suffers [dm][special][/c] points of damage. The hero increases his troop of [name] by [g][names][/c].
add_blog_ssacr_2=^blog_td0^[hero_name] casts the spell [spell]. Target ([targeta]) suffers [dm][special][/c] points of damage, [dd][target][/c] is killed. The hero increases his troop of [name] by [g][names][/c].
add_blog_skam_1=^blog_td0^[name]: the bomb explodes, inflicting [damage] points of damage.
add_blog_skam_0=^blog_td0^[name]: the bomb explodes.
add_blog_skam_2=^blog_td0^[name]: the bomb explodes, inflicting [damage] points of damage. [target]: [dead] is killed. [troopdef]
add_blog_skam_01=^blog_td0^[tab][name] suffer [damage] points of damage. 
add_blog_skam_02=^blog_td0^[tab][name] suffer [damage] points of damage. [dead] is killed. [troopdef]
add_blog_demon_summon_1=^blog_td0^[name]Portal[def] is activated! [target] emerges.
add_blog_demon_summon_2=^blog_td0^[name]Portal[def] is activated! [target]: [g][special][/c] emerge.
add_blog_snecro_1=^blog_td0^[hero_name] casts [spell]. Fallen troops ([targeta]) rise once again, as creatures of the undead. [target]: [dm][special][/c] are raised from the ashes.
add_blog_snecro_2=^blog_td0^[hero_name] casts [spell]. Fallen troops ([targeta]) rise once more, as creatures of the undead. [target]: [dm][special][/c] are raised from ashes.

add_blog_sheal_1=^blog_td0^[hero_name] casts [spell]. [target] recovers [g][special][/c] points of health.
add_blog_sheal_2=^blog_td0^[hero_name] casts [spell]. [target] recover [g][special][/c] points of health.
add_blog_sres_1=^blog_td0^[hero_name] casts [spell]. [target]: [g][special][/c] rises from the dead.
add_blog_sres_2=^blog_td0^[hero_name] casts [spell]. [target]: [g][special][/c] rise from the dead.
add_blog_cure_1=^blog_td0^[tab][target] recovers [g][special][/c] points of health.
add_blog_cure_2=^blog_td0^[tab][target] recover [g][special][/c] points of health.
add_blog_res_1=^blog_td0^[tab][target]: [g][special][/c] troop rises from the dead.
add_blog_res_2=^blog_td0^[tab][target]: [g][special][/c] troops rise from the dead.
add_blog_run_1=^blog_td0^[space][target] flees from the sanctified place.
add_blog_run_2=^blog_td0^[space][targets] flees from the sanctified place.

// New Titan Store and Remaining Energy
add_blog_ste_1=^blog_td0^[name]: [g][special][/c] point of Titan Energy is stored on the troop.
add_blog_ste_2=^blog_td0^[name]: [g][special][/c] points of Titan Energy are stored on the troop.
add_blog_rte_1=^blog_td0^[name]: [g][special][/c] point of Titan Energy remains on the troop.
add_blog_rte_2=^blog_td0^[name]: [g][special][/c] points of Titan Energy remain on the troop.
add_blog_dte=^blog_td0^[name]: Titan Energy dissipates!
add_blog_ate_1=^blog_td0^[name]: Titan Energy increases health of the [target] by [g][special2][/c] points! [g][special][/c] point of Titan Energy remains on the troop.
add_blog_ate_2=^blog_td0^[name]: Titan Energy increases health of the [target] by [g][special2][/c] points! [g][special][/c] points of Titan Energy remains on the troop.
add_blog_ate_d=^blog_td0^[name]: Titan Energy increases health of the [target] by [g][special2][/c] point! The Titan Energy dissipates!

// New (Veteran) Orc Post Hit
add_blog_orc_posthit_11=^blog_td0^[name]: Gets really angry! Its action points are restored and may move again!
add_blog_orc_posthit_12=^blog_td0^[name]: Get really angry! Their action points are restored and may move again!
add_blog_orc_posthit_21=^blog_td0^[name]: Gets really angry! Its action points increase 50% for the remainder of the round and their initiative is +1 for the remainder of the combat!
add_blog_orc_posthit_22=^blog_td0^[name]: Get really angry! Their action points increase 50% for the remainder of the round and their initiative is +1 for the remainder of the combat!

// New Archdemon Attack
add_blog_archdemon_attack=^blog_td0^[name]: A random spell is cast on [target].
add_blog_amal_attack=^blog_td0^[name]: An amalgamated spell is cast on [target].

// New Bone Dragon Attack
add_blog_bonedragon_attack=^blog_td0^[name]: A random Chaos Effect is cast on [target].

add_blog_sfantom_2=^blog_td0^[hero_name] casts [spell] and creates a copy of: [target]. Summon phantoms: [g][special][/c].
add_blog_phoen=^blog_td0^[hero_name] summons a magical creature. [targeta] appears.
add_blog_trap=^blog_td0^[hero_name] places a magical trap on the battlefield.
add_blog_demongate=^blog_td0^[hero_name] places the Demons' Portal on the battlefield
add_blog_pelena=^blog_td0^[hero_name] covers the battlefield with a magical veil of mist.
add_blog_nophant=^blog_td0^The magical phantom [name] vanishes from the battlefield.
add_blog_nopelena=^blog_td0^[name] vanishes from the battlefield.
//add_blog_last_hero=^blog_td0^[ally_unit_img][ally][target][/c]: one remains alive thanks to the spell [ally][special][/c].
add_blog_last_hero=^blog_td0^[ally_unit_img][ally][target][/c]: get a beneficial spell thanks to the spell [ally][special][/c].
add_blog_mana_source_1=^blog_td0^[name] writhes in pain. Spell [special] bestows upon the hero [hero_name] [g][target][/c] points of Mana.
add_blog_mana_source_2=^blog_td0^[name] writhes in pain. Spell [special] bestows upon the hero [hero_name] [g][target][/c] points of Mana.

sdmg_0=^blog_td0^[spell] does [damage] points of damage.
sdmg_1=^blog_td0^[spell] does [damage] points of damage. Target: [targeta].
sdmg_2=^blog_td0^[spell] does [damage] points of damage. [repl1][dead] [target] is killed. [troopdef]
sdmg_3=^blog_td0^[spell] does [damage] points of damage. Killed [targets]: [dead]. [troopdef]
sdmg=^blog_td0^[spell] inflicts area damage:
sdmg_s=^blog_td0^[spell] inflict area damage:

add_blog_trap_1=^blog_td0^[spell] was successfully cast, and inflicts [damage] points of damage. Target: [target].
add_blog_trap_2=^blog_td0^[spell] was successfully cast, and inflicts [damage] points of damage. [target]: [dead] is killed. [troopdef]
add_blog_remove_totem=^blog_td0^[spell] vanishes.

// Один встал в защиту
dfc_1=^blog_td0^[name] adopts a defensive posture: defense [defense].
// Много встало в защиту      
dfc_2=^blog_td0^[name] adopts a defensive posture: defense [defense].

// Один выжидает 
wait_1=^blog_td0^[name] is waiting for the right moment. 
// Много выжидает
wait_2=^blog_td0^[name] are waiting for a right moment. 

evasion_text=Evasion successful!
crit_evasion_1=^blog_td0^[evasion] [name] avoids critical damage.
crit_evasion_2=^blog_td0^[evasion] [name] avoid critical damage.

charm_text=Charm successful!
train_text=Command accepted!
charm_1=^blog_td0^[charm] [name] persuades [targets] to join her.
charm_2=^blog_td0^[charm] [names] persuade [targets] to join them.
train_1=^blog_td0^[charm] [name] subordinates the troop of [targets] to her will.
train_2=^blog_td0^[charm] [names] subordinate the troop of [targets] to their will.
add_blog_nocharm_1=^blog_td0^The spell of Charming fades, and [name] returns to their regular ranks! 
add_blog_nocharm_2=^blog_td0^The spell of Charming fades, and [name] return to their regular ranks! 
add_blog_rabid_1=^blog_td0^[space][special] becomes Frenzied, and will attack indiscriminately.
add_blog_rabid_2=^blog_td0^[space][special] become Frenzied, and will attack indiscriminately.
add_blog_norabid_1=^blog_td0^[name] overcomes the fit of rage.
add_blog_norabid_2=^blog_td0^[name] overcome the fit of rage.
add_blog_nosleep_1=^blog_td0^[name] awakens!
add_blog_nosleep_2=^blog_td0^[name] is awake!
add_blog_nounconscious_1=^blog_td0^[name] regains consciousness, but is still stunned!
add_blog_nounconscious_2=^blog_td0^[name] regain consciousness, but are still stunned!
add_blog_noram_1=^blog_td0^[name] transforms into another creature. [target] returns to the ranks! 
add_blog_noram_2=^blog_td0^[name] transforms into other creatures. [target] return to the ranks!
add_blog_noinvis_1=^blog_td0^[name] is visible again!
add_blog_noinvis_2=^blog_td0^[name] are visible again!

atk_gizmo_1=^blog_td0^[ally_spirit_img][ally][name] emits [saname]. [targets] takes [damage] points of damage.
atk_gizmo_2=^blog_td0^[ally_spirit_img][ally][name] emits [saname]. [targets] take [damage] points of damage.
atk_gizmo_1_1dead=^blog_td0^[ally_spirit_img][ally][name] emits [saname]. [targets] takes [damage] points of damage and [dead] dies.
atk_gizmo_1_2dead=^blog_td0^[ally_spirit_img][ally][name] emits [saname]. [targets] takes [damage] points of damage and [dead] die.
atk_gizmo_2_1dead=^blog_td0^[ally_spirit_img][ally][name] emits [saname]. [targets] take [damage] points of damage and [dead] dies.
atk_gizmo_2_2dead=^blog_td0^[ally_spirit_img][ally][name] emits [saname]. [targets] take [damage] points of damage and [dead] die.
atk_gizmo_1_troopdef=^blog_td0^[ally_spirit_img][ally][name] emits [saname]. [targets] takes [damage] points of damage - [troopdef]
atk_gizmo_2_troopdef=^blog_td0^[ally_spirit_img][ally][name] emits [saname]. [targets] take [damage] points of damage - [troopdef]
cure_1=^blog_td0^[ally_spirit_img][ally][name] affects [saname]. [targets] recovers [g][special][/c] health points.
cure_2=^blog_td0^[ally_spirit_img][ally][name] affects [saname]. [targets] recover [g][special][/c] health points.
res_gizmo_1=^blog_td0^[ally_spirit_img][ally][name] emits [saname]. [targets]: [g][special][/c] rises from the dead.
res_gizmo_2=^blog_td0^[ally_spirit_img][ally][name] emits [saname]. [targets]: [g][special][/c] rise from the dead.
apally_gizmo_1=^blog_td0^[ally_spirit_img][ally][name] releases [saname]. [targets]: action points restored to 50%!
apally_gizmo_2=^blog_td0^[ally_spirit_img][ally][name] releases [saname]. [targets]: action points increase +50%!
apenemy_gizmo_1=^blog_td0^[ally_spirit_img][ally][name] releases [saname]. [targets]: action points are halved!
apenemy_gizmo_2=^blog_td0^[ally_spirit_img][ally][name] releases [saname]. [targets]: action points are halved!
dispelbad_gizmo_1=^blog_td0^[ally_spirit_img][ally][name] discharges [saname]. [targets]: harmful effects removed.
dispelbad_gizmo_2=^blog_td0^[ally_spirit_img][ally][name] discharges [saname]. [targets]: harmful effects removed.
dispelgood_gizmo_1=^blog_td0^[ally_spirit_img][ally][name] discharges [saname]. [targets]: beneficial effects removed.
dispelgood_gizmo_2=^blog_td0^[ally_spirit_img][ally][name] discharges [saname]. [targets]: beneficial effects removed.
charges_gizmo_0=^blog_td0^[ally_spirit_img][ally][name] uses its [enemy]last[/c] charge! [ally]Bye![/c]
charges_gizmo_1=^blog_td0^[ally_spirit_img][ally][name] uses a charge and has [enemy]one[/c] charge left!
charges_gizmo_2=^blog_td0^[ally_spirit_img][ally][name] uses a charge and has [charges] charges left!

thorn_gift_cure_11=^blog_td0^[ally][name][/c] uses the ability [saname]: [ally][targets][/c] absorbs [g][special][/c] health points. [name] dies.
thorn_gift_cure_21=^blog_td0^[ally][name][/c] use the ability [saname]: [ally][targets][/c] absorbs [g][special][/c] health points. [name] die.
thorn_gift_cure_12=^blog_td0^[ally][name][/c] uses the ability [saname]: [ally][targets][/c] absorb [g][special][/c] health points. [name] dies.
thorn_gift_cure_22=^blog_td0^[ally][name][/c] use the ability [saname]: [ally][targets][/c] absorb [g][special][/c] health points. [name] die.
thorn_gift_res_11=^blog_td0^[ally][name][/c] uses the ability [saname]: [ally][targets][/c] absorbs [g][special][/c] health points - rejuvenating [g][special2][/c] of their kind with life! [name] dies.
thorn_gift_res_21=^blog_td0^[ally][name][/c] use the ability [saname]: [ally][targets][/c] absorbs [g][special][/c] health points - rejuvenating [g][special2][/c] of their kind with life! [name] die.
thorn_gift_res_12=^blog_td0^[ally][name][/c] uses the ability [saname]: [ally][targets][/c] absorb [g][special][/c] health points - rejuvenating [g][special2][/c] of their kind with life! [name] dies.
thorn_gift_res_22=^blog_td0^[ally][name][/c] use the ability [saname]: [ally][targets][/c] absorb [g][special][/c] health points - rejuvenating [g][special2][/c] of their kind with life! [name] die.

phoenix_sacrifice_cure_1=^blog_td0^[ally][name][/c] uses the ability [saname]: [ally][targets][/c] recovers [g][special][/c] health points. [name] dies.
phoenix_sacrifice_cure_2=^blog_td0^[ally][name][/c] uses the ability [saname]: [ally][targets][/c] recover [g][special][/c] health points. [name] dies.
phoenix_sacrifice_res_1=^blog_td0^[ally][name][/c] uses the ability [saname]: [ally][targets][/c] recovers [g][special][/c] health points - renewing [g][special2][/c] of their kind! [name] dies.
phoenix_sacrifice_res_2=^blog_td0^[ally][name][/c] uses the ability [saname]: [ally][targets][/c] recover [g][special][/c] health points - renewing [g][special2][/c] of their kind! [name] dies.

respawn_1=^blog_td0^[name] uses [saname]. [targets]:
respawn_2=^blog_td0^[name] use [saname]. [targets]: 
res_1=^blog_td0^[space][g][special][/c] is resurrected.
res_2=^blog_td0^[space][g][special][/c] are resurrected.
cur_1=^blog_td0^[space][g][special][/c] health point is recovered.
cur_2=^blog_td0^[space][g][special][/c] health points are recovered.

// добавки 
add_blog_split_2=^blog_td0^[name] uses the ability [saname]. The troop is split.
add_blog_split_1=^blog_td0^[name] use the ability [saname]. The troop is split.

add_blog_autodispell_1=^blog_td0^[name] removes all harmful spells.
add_blog_autodispell_2=^blog_td0^[name] remove all harmful spells.
add_blog_regen_1=^blog_td0^[name] has completely recovered.
add_blog_regen_2=^blog_td0^[name] have completely recovered.

add_blog_vamp_01=^blog_td0^[space][name] sucks [g][special][/c] points of health out of [targets] .
add_blog_vamp_02=^blog_td0^[space][names] suck [g][special][/c] points of health out of [targets].
add_blog_vamp_1=^blog_td0^[space][name] sucks the lifeblood out of [targets] and [g][special][/c] rises from the dead.
add_blog_vamp_2=^blog_td0^[space][names] suck the lifeblood out of [targets] and [g][special][/c] rise from the dead.
add_blog_soul_1=^blog_td0^[space][name] sucks the lifeblood out of [targets]. Fresh souls reanimate the troop: [g][special][/c].
add_blog_soul_2=^blog_td0^[space][names] suck the lifeblood out of [targets]. Fresh souls reanimate the troop: [g][special][/c].
add_blog_decay_2=^blog_td0^[space]The rot of death spreads forth, poisoning all around.
add_blog_decay_1=^blog_td0^[space]The rot of death spreads forth, poisoning poisons all around.

add_blog_place_1=^blog_td0^[name] places [saname] on the battlefield.
add_blog_place_2=^blog_td0^[names] place [saname] on the battlefield.
add_blog_summon_1=^blog_td0^[name] summons allies. [targeta] appear: [g][special][/c].
add_blog_summon_2=^blog_td0^[names] summon allies up. [targeta] appear: [g][special][/c].
add_blog_summon2_1=^blog_td0^[name] summons allies up. [special] appear: [g][special2][/c].

add_blog_gibe_1=^blog_td0^[name] laughs at the enemy. [targeta] becomes enraged!
add_blog_gibe_2=^blog_td0^[name] laugh at the enemy. [targeta] becomes enraged!
add_blog_change_1=^blog_td0^[name] swaps [targeta] with [special].
add_blog_change_2=^blog_td0^[name] swap [targeta] with [special].
add_blog_necro_1=^blog_td0^[name] performs a dark ritual and the fallen troops of ([target]) arise once more as creatures of the undead. [targeta]: [g][special][/c] rise from the ashes. 
add_blog_necro_2=^blog_td0^[name] perform a dark ritual and the fallen troops of ([target]) arise once more as creatures of the undead. [targeta]: [g][special][/c] rise from ashes. 

add_blog_trwolf_1=^blog_td0^[name] turns into a wolf.
add_blog_trwolf_2=^blog_td0^[names] turn into wolves.
add_blog_trbat_1=^blog_td0^[name] turns into a bat.
add_blog_trbat_2=^blog_td0^[names] turn into bats.
add_blog_tr_1=^blog_td0^[name] assumes human form.
add_blog_tr_2=^blog_td0^[names] assume human form.

add_blog_mana_1=^blog_td0^[name] recovers [g][special][def] points of Mana for [hero_name].
add_blog_mana_2=^blog_td0^[names] recover [g][special][def] points of Mana for [hero_name] .
add_blog_mana1_1=^blog_td0^[name] recovers [g][special][def] points of Mana for [hero_name] and inflicts [damage] points of Damage. Target: [targeta].
add_blog_mana1_2=^blog_td0^[names] recover [g][special][def] points of Mana for [hero_name] and inflict [damage] points of Damage. Target: [targeta].

add_blog_anger_1=^blog_td0^[space][special] enjoys the enemy's suffering. Damage and chance of critical attack is increased.
add_blog_anger_2=^blog_td0^[space][special] enjoy the enemy's suffering. Damage and chance of critical attack is increased.
add_blog_brutality_1=^blog_td0^[special] falls into a rage! Double attack.
add_blog_brutality_2=^blog_td0^[special] fall into a rage! Double attack.
add_blog_unbaff_1=^blog_td0^[space]The positive effect [g][special] is removed from the target.
add_blog_unbaff_2=^blog_td0^[space]The positive effect [g][special] is removed from the target.
add_blog_bleeding_1=^blog_td0^[space][targets] is bleeding.
add_blog_bleeding_2=^blog_td0^[space][targets] are bleeding.
add_blog_hemoraging_1=^blog_td0^[space][targets] is hemoraging (duration +1)!
add_blog_hemoraging_2=^blog_td0^[space][targets] are hemoraging (duration +1)!

add_blog_burn_1=^blog_td0^[space][target] is burning.
add_blog_burn_2=^blog_td0^[space][targets] are burning.
add_blog_ablaze_1=^blog_td0^[space][target] is ablaze (duration +1)!
add_blog_ablaze_2=^blog_td0^[space][targets] are ablaze (duration +1)!
add_blog_shock_1=^blog_td0^[space][target] is shocked.
add_blog_shock_2=^blog_td0^[space][targets] are shocked.
add_blog_jolt_1=^blog_td0^[space][target] is jolted with electricty (duration +1)!
add_blog_jolt_2=^blog_td0^[space][targets] are jolted with electricty (duration +1)!
add_blog_freeze_1=^blog_td0^[space][target] becomes frozen.
add_blog_freeze_2=^blog_td0^[space][targets] become frozen.
add_blog_bitter_1=^blog_td0^[space][target] becomes bitterly frozen (duration +1)!
add_blog_bitter_2=^blog_td0^[space][targets] become bitterly frozen (duration +1)!
add_blog_poison_1=^blog_td0^[space][target] is poisoned.
add_blog_poison_2=^blog_td0^[space][targets] are poisoned.
add_blog_noxious_1=^blog_td0^[space][target] is noxiously poisoned (duration +1)!
add_blog_noxious_2=^blog_td0^[space][targets] are noxiously poisoned (duration +1)!
add_blog_holy_1=^blog_td0^[space][target] is affected by a holy power.
add_blog_holy_2=^blog_td0^[space][targets] are affected by a holy power.
add_blog_sanctified_1=^blog_td0^[space][target] is affected by a sanctified holy power (duration +1)!
add_blog_sanctified_2=^blog_td0^[space][targets] are affected by a sanctified holy power (duration +1)!
add_blog_slow_1=^blog_td0^[space][target] becomes slow.
add_blog_slow_2=^blog_td0^[space][targets] become slow.
add_blog_stun_1=^blog_td0^[space][target] is stunned.
add_blog_stun_2=^blog_td0^[space][targets] are stunned.
add_blog_daze_1=^blog_td0^[space][target] is dazed (duration +1)!
add_blog_daze_2=^blog_td0^[space][targets] are dazed (duration +1)!
add_blog_weakness_1=^blog_td0^[space][target] weakens.
add_blog_weakness_2=^blog_td0^[space][targets] weaken.
add_blog_weaker_1=^blog_td0^[space][target] grows weaker (duration +1)!
add_blog_weaker_2=^blog_td0^[space][targets] grow weaker (duration +1)!
add_blog_fear_1=^blog_td0^[space][target] is scared.
add_blog_fear_2=^blog_td0^[space][targets] are scared.
add_blog_entangle_1=^blog_td0^[space][target] is entangled.
add_blog_entangle_2=^blog_td0^[space][targets] are entangled.
add_blog_snarl_1=^blog_td0^[space][target] is snarled (duration +1)!
add_blog_snarl_2=^blog_td0^[space][targets] are snarled (duration +1)!
add_blog_dampoison_1=^blog_td0^[enemy_spell_img][enemy]Poison[def] does [damage] points of damage. [name] shivers in pain.
add_blog_dampoison_2=^blog_td0^[enemy_spell_img][enemy]Poison[def] does [damage] points of damage. [name]: [dead] is killed. [troopdef] 
add_blog_dampoison_3=^blog_td0^[enemy_spell_img][enemy]Poison[def] does [damage] points of damage. [name] convulses with pain!
add_blog_res_poison_1=^blog_td0^[enemy_spell_img][enemy][name] resists the poison effect!
add_blog_res_poison_2=^blog_td0^[enemy_spell_img][enemy][name] resist the poison effect!
add_blog_damfire_1=^blog_td0^[enemy_spell_img][enemy]Fire[def] does [damage] points of damage. [name] is burning. 
add_blog_damfire_2=^blog_td0^[enemy_spell_img][enemy]Fire[def] does [damage] points of damage. [name]: [dead] is killed. [troopdef] 
add_blog_damfire_3=^blog_td0^[enemy_spell_img][enemy]Fire[def] does [damage] points of damage. [name] is seethingly ablaze!
add_blog_res_burn_1=^blog_td0^[enemy_spell_img][enemy][name] resists the burn effect!
add_blog_res_burn_2=^blog_td0^[enemy_spell_img][enemy][name] resist the burn effect!

add_blog_nofear_1=^blog_td0^The fear vanishes, and [name] regains self-command.
add_blog_nofear_2=^blog_td0^The fear vanishes, and [name] regain self-command.
add_blog_nobers_1=^blog_td0^[name] recovers from an uncontrollable fury.
add_blog_nobers_2=^blog_td0^[name] recover from their uncontrollable fury.

add_blog_sleep_1=^blog_td0^[space][target] falls asleep.
add_blog_sleep_2=^blog_td0^[space][targets] fall asleep.
add_blog_unconscious_1=^blog_td0^[space][target] is knocked unconscious.
add_blog_unconscious_2=^blog_td0^[space][targets] are knocked unconscious.
add_blog_bsleep_1=^blog_td0^[name] is tired from inactivity and falls asleep.
add_blog_bsleep_2=^blog_td0^[name] are tired from inactivity and fall asleep.
add_blog_curse_1=^blog_td0^[space][target] is cursed.
add_blog_curse_2=^blog_td0^[space][targets] are cursed.
add_blog_execrate_1=^blog_td0^[space][target] is execrated!
add_blog_execrate_2=^blog_td0^[space][targets] are execrated!

add_log_stonewall=^blog_td0^[spell] appears on the battlefield. Health: [g][special][/c].

battle_long=The battle is long!
battle_drawn=The battle is long and drawn out!
battle_hard=The battle has been long and hard!
battle_drudge=The battle drudgery continues...
rage_mana_deficit_detected_1=^blog_td0^[g][long][/c] Extended combat has sapped the strength of your warriors, and decreased their capacity to channel magical energy. Mana Restoration and Rage Increase are halved. Your troop's morale (except Undead and Golems) decreases by [dd]1[/c]!
rage_mana_deficit_detected_2=^blog_td0^[g][drawn][/c] Your warriors grow very tired, and magical energy is very short. Mana Restoration and Rage Increase are quartered. Your troops' morale and initiative (except Golems and Plants) decrease by [dd]1[/c]!
rage_mana_deficit_detected_3=^blog_td0^[g][hard][/c] The exhausting battle has drained all the magic from this place, and weary doom floods your warriors' eyes: all bloodlust is gone. You can no longer restore Rage or Mana! Your troop's morale, initiative, and speed (except Golems and Plants) decrease by [dd]1[/c]!
extremely_long_combat=^blog_td0^[g][drudge][/c] and your troops are becoming increasingly more tired and irritable! Your troop's morale, initiative, and speed continue to decrease by [dd]1[/c] and reloadable attacks no longer reload!

enemy_hero_book_times_log=^blog_td0^[enemy][hero_name][/c] is [dm][special2][/c] skilled with magic and can cast [dd][special][/c] spells per round.
enemy_hero_mana_regen_log=^blog_td0^[enemy][hero_name][/c] recovers [dd][special][/c] Mana and now has [dm][special2][/c] total Mana (cursor over orb to see correct value).
darkcrystal_recharge_enemy_hero_log=^blog_td0^[enemy][name][/c] converts damage to mana, recharging [enemy][hero_name][/c] with [dd][special][/c] Mana, who now has [dm][special2][/c] total Mana (cursor over orb to see correct value).
concentration_log=^blog_td0^Your abilities regenerate [stc][special][/c] point(s) of [g]Mana[/c].
// New! Additional logs for hero skills
brutality_log=^blog_td0^Your abilities generate [stc][special][/c] point(s) of [g]Rage[/c].
start_defense_log=^blog_td0^The [skc][name][/c] skill gives your troops [stc]+[special][/c] to their [g]Physical Resistance[/c] during the first round!
rush_i_log=^blog_td0^The [skc][name][/c] skill gives your troops [stc]+[special][/c] to their [g]Initiative[/c] during the first round!
rush_s_log=^blog_td0^The [skc][name][/c] skill gives your troops [stc]+[special][/c] to their [g]Speed[/c] during the first round!
hi_magic_log=^blog_td0^The [skc][name][/c] skill allows your hero to cast [stc][special][/c] [g]Spells[/c] this round!
rage_log=^blog_td0^[g]Frenzy![/c] Having killed the enemy, your troop receives [g]+[special][/c] Attack.
looter_log=^blog_td0^[g]Marauding![/c] Searching the bodies, Marauders find [g][special][/c] gold.
itm_boots_log=^blog_td0^[g]Pilgrim boots[/c] increase the speed of the slowest troop!
itm_predator_log=^blog_td0^[g]Rage Predator[/c] absorbs [enemy][special][/c] points of Rage and transfers to you [g][special2][/c] points of Mana!

//Хинт урона
dmg_hint_dmg=^bl_hint_dmg_t^Damage: [damage].
dmg_hint_dead=^bl_hint_dmg_t^Kills: [dead].
dmg_hint_ret=^bl_hint_dmg_t^The enemy will counterattack.
dmg_hint_just_dmg=^bl_hint_dmg_t^Damage: 
dmg_hint_just_dead=^bl_hint_dmg_t^Kills:
dmg_hint_simple_dmg=Damage: 
dmg_hint_simple_dead=Kills:
dmg_hint_just_raise=^bl_hint_dmg_t^Resurrected:
dmg_hint_just_heal=^bl_hint_dmg_t^Recovers health:
dmg_hint_just_effectiveness=^bl_hint_dmg_t^Effectiveness:
dmg_hint_total_leadership=^bl_hint_dmg_t^Total Leadership Units:
dmg_hint_at_max_leadership=^bl_hint_dmg_t^<color=0,192,0>(Troop will be at max leadership)</color>
dmg_hint_over_max_leadership=^bl_hint_dmg_t^<color=192,0,0>over max leadership - troop will be out of control!!!)</color>
dmg_hint_under_max_leadership=^bl_hint_dmg_t^<color=255,255,50>under max leadership)</color>
dmg_hint_sacrifice_bonus=^bl_hint_dmg_t^Get units:
dmg_hint_format_ally=^bl_hint_dmg_t^<color=134,220,250>
dmg_hint_format_enemy=^bl_hint_dmg_t^<color=255,140,140>
dmg_hint_phoenix_sacrifice=^bl_hint_dmg_t^<color=192,0,0>dies!</color>

critical_damage=Critical Attack! 
round_big_text=^int_ffo_fly_t^[minfo3]Turn
round_start=^blog_td0^[new_round]Round [round] begins.
battle_start=^blog_td0^[new_round]The battle has commenced!
battle_end_win=^blog_td0^[new_round]The battle has finished. Victory!
battle_end_lose=^blog_td0^[new_round]The battle has finished. You are defeated!
battle_end_ooc=^blog_td0^[new_round]All your troops are out of control!
troop_defeated=The troop is killed.
miss=Miss!

fear_1=^blog_td0^[target] becomes frightened!
fear_2=^blog_td0^[targets] become frightened!

change_place=^blog_td0^[name] swap [target] with [targeta].

//Боссы
blog_boss_slow=^blog_td0^[name] uses spell [saname]. Your troops become slow! 
blog_boss_escape=^blog_td0^[name] dives into the earth and re-emerges in another place.

//Спириты
slime_fog=^blog_td0^[ally_spirit_img][ally][name][def] Summons [ally][target][def] to the battlefield. 
lina_gizmo_1=^blog_td0^[ally_spirit_img][ally][name][def] Summons [ally][target][def] to the battlefield. [ally][target][def] has [enemy]one[/c] Attack / Resurrection charge.
lina_gizmo_2=^blog_td0^[ally_spirit_img][ally][name][def] Summons [ally][target][def] to the battlefield. [ally][target][def] has [charges] Attack / Resurrection charges.
slime_gizmo=^blog_td0^[enemy_unit_img][enemy][name][def] has spent all his energy and leaves the battlefield.
slime_glot=^blog_td0^[ally_spirit_img][ally][name][def] grants invulnerability to your troop! Target: [ally][target][def].
slime_glot_remove=^blog_td0^[ally_spirit_img][ally][name][def] is destroyed.
lina_enbox=^blog_td0^[ally_spirit_img][ally][name][def] creates several centers of magic on the battlefield.
death_time_return=^blog_td0^[ally_spirit_img][ally][name][def] manipulates time, transferring your troop back in the past. Target: [target][def].

//Тотемы
//add_blog_cure_1
add_blog_totem_life=^blog_td0^[name] is illuminated with magical light!

//MegaREPL
glot_repl1=Glot's Armor is destroyed.
glot_repl2=is destroyed
glot_repl3=^blog_td0^[ally][name][def] intercepts [damage] points of damage from the target: [undera]
gremlin_repl1=^blog_td0^[target] is killed.
thewall_repl1=^blog_td0^[target] is destroyed.
devatron_repl1=^blog_td0^[target] is destroyed.

//Цвета
blog_enemy_color=^blog_td0^[enemy]
blog_ally_color=^blog_td0^[ally]
blog_enemy_unit=^blog_td0^[enemy]
blog_ally_unit=^blog_td0^[ally]
blog_enemy_spell=^blog_td0^[enemy]
blog_ally_spell=^blog_td0^[ally]
blog_enemy_spirit=^blog_td0^[enemy]
blog_ally_spirit=^blog_td0^[ally]
blog_enemy_hero=^blog_td0^[enemy]
blog_player_hero=^blog_td0^[ally]

//Картинки
blog_enemy_unit_img=^blog_td0^[enemy_unit_img]
blog_ally_unit_img=^blog_td0^[ally_unit_img]
blog_enemy_spell_img=^blog_td0^[enemy_spell_img]
blog_ally_spell_img=^blog_td0^[ally_spell_img]
blog_enemy_spirit_img=^blog_td0^[enemy_spirit_img]
blog_ally_spirit_img=^blog_td0^[ally_spirit_img]
